# CSV(Comma Seperated Values)
- 쉼표로 Data를 구분하고 줄바꿈으로 행을 바꾼다.

In [1]:
import pandas as pd

In [4]:
df1 = pd.read_csv("../Data/read_csv_sample.csv")
df1

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [5]:
# header = None => 맨위의 컬럼이 데이터로 들어옴 (default = True)
df2 = pd.read_csv("../Data/read_csv_sample.csv",header=None)
df2

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [6]:
# index_col = None (default)
df3 = pd.read_csv("../Data/read_csv_sample.csv",index_col=None)
df3

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [7]:
df4 = pd.read_csv("../Data/read_csv_sample.csv",index_col='c1')
df4

    c0  c2  c3
c1
1    0   4   7
2    1   5   8
3    2   6   9

---
# Excel File

In [12]:
df1 = pd.read_excel("../Data/남북한발전전력량.xlsx")
df1

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

# JSON

In [13]:
df = pd.read_json("../Data/read_json_sample.json")
df

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

# html

In [15]:
url = "../Data/sample.html"
tables = pd.read_html(url)
tables

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [16]:
len(tables)

2

In [17]:
df = tables[1]
df

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [18]:
df.set_index('name',inplace=True)
df

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

# API를 활용하여 데이터 수집하기

## Google Geocoding
- 장소 이름 또는 주소를 입력하면 위도와 경도 좌표 정보를 변환해 주는 서비스
- API키를 발급 받아야 사용가능하며, 등록시 신용카드 정보가 필요하며 무표 사용량을 초과하면 요금을 지불해야하는 상황이 발생

## Google Geocoding 발급절차
- 구글지도서비스(https://cloud.google.com/maps-platform/places/?hl=ko)에 접속
- 새 프로젝트 만들기
- API 설정
- 사용자 인증
- API Key 발급

In [19]:
# GoogleMaps 설피
!pip install googlemaps

Collecting googlemaps
  Downloading googlemaps-4.6.0.tar.gz (31 kB)
Requirement already satisfied: requests<3.0,>=2.20.0 in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (from googlemaps) (2.26.0)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (1.26.7)
Requirement already satisfied: charset-normalizer~=2.0.0 in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2021.10.8)
Requirement already satisfied: idna<4,>=2.5 in /Users/tj/opt/anaconda3/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (3.2)
Building wheels for collected packages: googlemaps
  Building wheel for googlemaps (setup.py) ... done
  Created wheel for googlemaps: filename=googlemaps-4.6.0-py3-none-any.whl size=38552 sha256=5e5f6a4192cd574fb310395c469cb59e926a4ca7946559688ecb68d139eacb22
  Stored in directory: /Users/tj/Library/Caches/pip/wheels/b6/23/aa/a130b53682531f8382dd06f2000001225bea7b56a99c516f87
Successfully built googlemaps
Installing collected packages: googlemaps
Successfully installed googlemaps-4.6.0

In [20]:
import googlemaps

In [22]:
my_key = "AIzaSyDKrsnrHRBwIyWpO-VJoiFU8C9RYPsdqtc"
maps = googlemaps.Client(key=my_key)
lat = [] # 위도
lng = [] # 경도

In [23]:
# 장소(또는 주소) 리스트
places = ['서울시청','국립국악원','해운대해수욕장']

In [24]:
i =0
for place in places:
    i += 1
    try:
        print(i,place)
        geo_location = maps.geocode(place)[0].get('geometry')
        lat.append(geo_location['location']['lat'])
        lng.append(geo_location['location']['lng'])
    except:
        lat.append('')
        lng.append('')
        print(i)

1 서울시청
2 국립국악원
3 해운대해수욕장

In [25]:
lat

[37.566535, 37.4777592, 35.1586975]

In [26]:
lng

[126.9779692, 127.0083043, 129.1603842]

In [28]:
# 데이터 프레임으로 변환하기

df = pd.DataFrame({'위도':lat,'경도':lng},index=places)
df

                위도          경도
서울시청     37.566535  126.977969
국립국악원    37.477759  127.008304
해운대해수욕장  35.158698  129.160384

In [29]:
# Excel file로 저장하기

df.to_excel("../Data/geocoding.xlsx") # sheet_name = '' sheet의 이름을 설정가능